run/tutorial2b/fluidBlock/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 5 0);

boundaryField
{
    fluidInlet
    {
        type            fixedValue;
        value           uniform (0 5 0);
    }

    fluidOutlet
    {
        type            inletOutlet;
        inletValue      uniform (0 5 0);
        value           uniform (0 5 0);
    }

    fluidCoupledWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    fluidSide
    {
        type            symmetryPlane;
    }

    defaultFaces
    {
        type            empty;
    }

}

// ************************************************************************* //
