run/tutorial2b/fluidBlock/0/kappaEff
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      kappaEff;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 1 -3 -1 0 0 0];

internalField   uniform 1e-3;

boundaryField
{
    fluidInlet
    {
        type            zeroGradient;
    }

    fluidOutlet
    {
        type            zeroGradient;
    }

    fluidCoupledWall
    {
        type            regionCoupling;
        value           uniform 1e-3;
        remoteField     k;
    }

    fluidSide
    {
        type            symmetryPlane;
    }

    defaultFaces
    {
        type            empty;
    }

}

// ************************************************************************* //
