run/tutorial2b/fluidBlock/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    fluidInlet
    {
        type            calculated;
        value           uniform 0;
    }
    fluidOutlet
    {
        type            calculated;
        value           uniform 0;
    }
    fluidCoupledWall
    {
        type            calculated;
        value           uniform 0;
    }
    fluidSide
    {
        type            symmetryPlane;
    }
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
