run/tutorial2b/fluidBlock/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (2 0   0)         // 0
    (4 0   0)         // 1
    (6 0   0)         // 2
    (2 20  0)         // 3
    (4 20  0)         // 4
    (6 20  0)         // 5
    (2 40  0)         // 6
    (4 40  0)         // 7
    (6 40  0)         // 8
    (2 70  0)         // 9
    (4 70  0)         // 10
    (6 70  0)         // 11
    (2 90  0)         // 12
    (4 90  0)         // 13
    (6 90  0)         // 14
    (2 130 0)         // 15
    (4 130 0)         // 16
    (6 130 0)         // 17
    (2 0   0.1)       // 18
    (4 0   0.1)       // 19
    (6 0   0.1)       // 20
    (2 20  0.1)       // 21
    (4 20  0.1)       // 22
    (6 20  0.1)       // 23
    (2 40  0.1)       // 24
    (4 40  0.1)       // 25
    (6 40  0.1)       // 26
    (2 70  0.1)       // 27
    (4 70  0.1)       // 28
    (6 70  0.1)       // 29
    (2 90  0.1)       // 30
    (4 90  0.1)       // 31
    (6 90  0.1)       // 32
    (2 130 0.1)       // 33
    (4 130 0.1)       // 34
    (6 130 0.1)       // 35
);

blocks
(
    hex (0 1 4 3 18 19 22 21) (20 20 1) simpleGrading (1 1 1) // block0
    hex (1 2 5 4 19 20 23 22) (20 20 1) simpleGrading (1 1 1) // block1
    hex (4 5 8 7 22 23 26 25) (20 20 1) simpleGrading (1 1 1) // block2
    hex (6 7 10 9 24 25 28 27) (20 30 1) simpleGrading (1 1 1) // block3
    hex (7 8 11 10 25 26 29 28) (20 30 1) simpleGrading (1 1 1) // block4
    hex (10 11 14 13 28 29 32 31) (20 20 1) simpleGrading (1 1 1) // block5
    hex (12 13 16 15 30 31 34 33) (20 40 1) simpleGrading (1 1 1) // block6
    hex (13 14 17 16 31 32 35 34) (20 40 1) simpleGrading (1 1 1) // block 7
);

edges
(
);

patches
(
    patch fluidInlet
    (
        (1 19 18 0)
	(1 2 20 19)
    )
    patch fluidOutlet
    (
     (17 16 34 35)
     (16 15 33 34)
    )
    patch fluidCoupledWall
    (
        (0 18 21 3)
        (3 4 22 21)
        (7 4 22 25)
        (7 6 24 25)
        (6 24 27 9)
        (9 10 28 27)
        (13 10 28 31)
        (13 12 30 31)
        (12 30 33 15)

    )
    symmetryPlane fluidSide
    (
        (2 5 23 20)
        (5 8 26 23)
        (8 11 29 26)
        (11 14 32 29)
        (14 17 35 32)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
