run/tutorial2b/fluidBlock/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           PCG;
        preconditioner   DIC;

        minIter          0;
        maxIter          1000;
        tolerance        1e-12;
        relTol           0.01;
    };

    U
    {
        solver           PBiCG;
        preconditioner   DILU;

        minIter          1;
        maxIter          1000;
        tolerance        1e-12;
        relTol           0.01;
    };

    T+T
    {
        solver           BiCG;
        preconditioner   Cholesky;

        minIter          1;
        maxIter          100;
        tolerance        1e-12;
        relTol           0.01;
    };

    G
    {
        solver           PCG;
        preconditioner   DIC;

        minIter          1;
        maxIter          1000;
        tolerance        1e-12;
        relTol           0.1;
    };

    epsilon
    {
        solver           PBiCG;
        preconditioner   DILU;

        minIter          1;
        maxIter          100;
        tolerance        1e-12;
        relTol           0.01;
    };

    k
    {
        solver           PBiCG;
        preconditioner   DILU;

        minIter          1;
        maxIter          100;
        tolerance        1e-12;
        relTol           0.01;
    };
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

relaxationFactors
{
    p               0.7;
    U               0.3;
    T+T             0.75;
    k               0.8;
    epsilon         0.8;
    // R               0.7;
    // nuTilda         0.7;
}

// ************************************************************************* //
